package homework5;

//Задание 4
/*
 *Создайте метод compareNumbers(), в теле которого объявите две int переменные a и b, и инициализируйте их любыми
 *  значениями, которыми захотите. Если a больше или равно b, то необходимо вывести в консоль сообщение “a >= b”,
 * в противном случае “a < b”;
 */
public class task4 {
    public static void compareNumbers(){
        int a = 9;
        int b = 8;
        System.out.println((a>=b)?"a >= b":"a >= b");
    }
}
