package homework5;

//Задание 1
//Создайте метод printThreeWords(), который при вызове должен отпечатать в столбец три слова: Orange, Banana, Apple.
public class task1 {
    public static void printThreeWords(){
        //Печатает в столбец три слова: Orange, Banana, Apple
        System.out.println("Orange");
        System.out.println("Banana");
        System.out.println("Apple");
    }

    public static void main(String[] args) {
        printThreeWords();
    }




}